<?php


$point['A1'][1]="教師瞭解學科的內容、與其他學科的關連，以及在生活上的運用。";
$point['A1'][2]="教師轉化學科與教學知識，提供學生有意義的學習經驗。";
$point['A1'][3]="教師瞭解學生的發展與學習，並運用在課程設計上。";

$point['A2'][1]="教師依據課程綱要、學生的發展與學習，擬定課程計畫。";
$point['A2'][2]="教師依據教學目標及學生先備知識，研擬教學計畫。";
$point['A2'][3]="教師發展的教學計畫顧及學生不同成就水準、特殊需求與社會文化背景。";

$point['A3'][1]="教師向學生說明學習目標與重點。";
$point['A3'][2]="教師引發和維持學生的學習動機。";
$point['A3'][3]="教師依據教學目標、教材性質及學生程度選用適當的教學策略。";
$point['A3'][4]="教師善用校內外相關的教學資源。";
$point['A3'][5]="教師培養學生基本的知識與能力。";
$point['A3'][6]="教師發展學生高層次的思考能力。";
$point['A3'][7]="教師培養學生的道德與情意發展";

$point['A4'][1]="教師持續檢視學生的學習情況與進展。";
$point['A4'][2]="教師蒐集多元資料評量學生的學習成效。";
$point['A4'][3]="教師利用評量結果調整教學。";
$point['A4'][4]="教師將學生的學習情形與成果，告知學生與家長。";

$point['B1'][1]="教師建立有助於學習的班級常規。";
$point['B1'][2]="教師安排有助於學習的教室環境。";
$point['B1'][3]="教師營造尊重、公平和溫暖的班級氣氛。";
$point['B1'][4]="教師與學生建立正向的互動關係。";

$point['B2'][1]="教師瞭解任教班級學生的基本資料。";
$point['B2'][2]="教師善用輔導資源，進行生活、學習或生涯輔導。";


$point['C1'][1]="教師反思教學歷程與成效以改進教學。";
$point['C1'][2]="教師運用進修或研究成果於教學實務。";
$point['C1'][3]="教師參與校內外的教育專業社群。";

$point['C2'][1]="教師與學校同事維持積極的互動關係。";
$point['C2'][2]="教師與家長維持積極的互動關係。";

$point['C3'][1]="教師參與學校中與教學有關的運作與活動。";
$point['C3'][2]="教師掌握並有效因應教育變革情況。";

?>
